SET NAMES 'utf8mb4';
USE healthcare;

INSERT INTO address(id, fulladdress, ward_id, created_date) VALUES
(1, 'Số Nhà, Đường', 157, '2023-03-16 00:07:13'),
(2, 'Số Nhà, Đường', 293, '2023-03-16 03:55:09'),
(3, 'Số Nhà, Đường', 79, '2023-03-16 20:57:11'),
(4, 'Số Nhà, Đường', 209, '2023-03-16 09:13:41'),
(5, 'Số Nhà, Đường', 287, '2023-03-16 17:04:29'),
(6, 'Số Nhà, Đường', 172, '2023-03-16 01:35:45'),
(7, 'Số Nhà, Đường', 36, '2023-03-16 11:08:09'),
(8, 'Số Nhà, Đường', 63, '2023-03-16 02:17:06'),
(9, 'Số Nhà, Đường', 199, '2023-03-16 00:01:04'),
(10, 'Số Nhà, Đường', 104, '2023-03-16 13:49:58'),
(11, 'Số Nhà, Đường', 4, '2023-03-16 19:21:27'),
(12, 'Số Nhà, Đường', 39, '2023-03-16 00:00:05'),
(13, 'Số Nhà, Đường', 153, '2023-03-16 16:30:18'),
(14, 'Số Nhà, Đường', 78, '2023-03-16 00:00:01'),
(15, 'Số Nhà, Đường', 196, '2023-03-16 09:24:26'),
(16, 'Số Nhà, Đường', 98, '2023-03-16 00:01:14'),
(17, 'Số Nhà, Đường', 13, '2023-03-16 00:42:37'),
(18, 'Số Nhà, Đường', 83, '2023-03-16 00:15:42'),
(19, 'Số Nhà, Đường', 304, '2023-03-16 02:59:27'),
(20, 'Số Nhà, Đường', 131, '2023-03-16 00:01:23'),
(21, 'Số Nhà, Đường', 51, '2023-03-16 01:48:16'),
(22, 'Số Nhà, Đường', 40, '2023-03-16 18:24:43'),
(23, 'Số Nhà, Đường', 85, '2023-03-16 01:56:17'),
(24, 'Số Nhà, Đường', 233, '2023-03-16 15:53:50'),
(25, 'Số Nhà, Đường', 7, '2023-03-16 00:05:13'),
(26, 'Số Nhà, Đường', 35, '2023-03-16 13:56:39'),
(27, 'Số Nhà, Đường', 143, '2023-03-16 17:04:14'),
(28, 'Số Nhà, Đường', 9, '2023-03-16 00:01:28'),
(29, 'Số Nhà, Đường', 2, '2023-03-16 17:32:19'),
(30, 'Số Nhà, Đường', 188, '2023-03-16 00:01:38'),
(31, 'Số Nhà, Đường', 1, '2023-03-16 16:53:06'),
(32, 'Số Nhà, Đường', 190, '2023-03-16 05:18:26'),
(33, 'Số Nhà, Đường', 211, '2023-03-16 22:59:39'),
(34, 'Số Nhà, Đường', 139, '2023-03-16 01:00:18'),
(35, 'Số Nhà, Đường', 277, '2023-03-16 00:21:55'),
(36, 'Số Nhà, Đường', 125, '2023-03-16 03:53:25'),
(37, 'Số Nhà, Đường', 71, '2023-03-16 06:08:56'),
(38, 'Số Nhà, Đường', 6, '2023-03-16 09:47:10'),
(39, 'Số Nhà, Đường', 80, '2023-03-16 16:07:17'),
(40, 'Số Nhà, Đường', 60, '2023-03-16 11:41:08'),
(41, 'Số Nhà, Đường', 13, '2023-03-16 00:08:35'),
(42, 'Số Nhà, Đường', 11, '2023-03-16 22:41:56'),
(43, 'Số Nhà, Đường', 254, '2023-03-16 17:49:14'),
(44, 'Số Nhà, Đường', 1, '2023-03-16 20:38:45'),
(45, 'Số Nhà, Đường', 96, '2023-03-16 00:02:22'),
(46, 'Số Nhà, Đường', 136, '2023-03-16 01:34:59'),
(47, 'Số Nhà, Đường', 197, '2023-03-16 20:24:39'),
(48, 'Số Nhà, Đường', 158, '2023-03-16 09:48:17'),
(49, 'Số Nhà, Đường', 253, '2023-03-16 22:25:30'),
(50, 'Số Nhà, Đường', 59, '2023-03-16 02:45:15');

set sql_safe_updates = 0;
update address addr
	left join ward wrd on addr.ward_id = wrd.id
    left join district dist on wrd.district_id = dist.id
    left join province prvn on dist.province_id = prvn.id
set fulladdress = concat_ws(', ', addr.fulladdress, wrd.title, dist.title, prvn.name);
set sql_safe_updates = 1;
