SET NAMES 'utf8mb4';
USE healthcare;

INSERT INTO district(id, title, province_id, created_date) VALUES
(1, 'Quận Gò Vấp', 30, '2023-03-15 19:04:23'),
(2, 'Quận Tân Phú', 30, '2023-03-15 17:10:48'),
(3, 'Huyện Cần Giờ', 30, '2023-03-15 01:08:43'),
(4, 'Huyện Hóc Môn', 30, '2023-03-15 00:01:08'),
(5, 'Quận Bình Thạnh', 30, '2023-03-15 22:13:11'),
(6, 'Quận 1', 30, '2023-03-15 10:12:01'),
(7, 'Huyện Củ Chi', 30, '2023-03-15 19:00:42'),
(8, 'Quận 8', 30, '2023-03-15 19:45:15'),
(9, 'Quận 5', 30, '2023-03-15 02:17:18'),
(10, 'Quận 12', 30, '2023-03-15 19:13:58'),
(11, 'Quận Phú Nhuận', 30, '2023-03-15 19:14:04'),
(12, 'Quận Bình Tân', 30, '2023-03-15 00:10:13'),
(13, 'Quận 3', 30, '2023-03-15 12:36:19'),
(14, 'Quận 6', 30, '2023-03-15 23:51:06'),
(15, 'Quận 10', 30, '2023-03-15 01:51:30'),
(16, 'Huyện Bình Chánh', 30, '2023-03-15 00:00:01'),
(17, 'Quận 7', 30, '2023-03-15 15:04:40'),
(18, 'Huyện Nhà Bè', 30, '2023-03-15 07:02:03'),
(19, 'Quận 11', 30, '2023-03-15 20:05:05'),
(20, 'Quận 4', 30, '2023-03-15 11:04:27'),
(21, 'Thành phố Thủ Đức', 30, '2023-03-15 20:08:45'),
(22, 'Quận Tân Bình', 30, '2023-03-15 08:11:01');

set sql_safe_updates = 0;
update district
set search_text = lower(title);
set sql_safe_updates = 1;